Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/ruby-omegat.tmx
Source language: en_us
Languages: pt_br

source: Syntax error, unexpected {0}
pt_br: Erro de sintaxe, não era esperado {0}

source: Only a-z, A-Z, digits and underscore are safe in Ruby names
pt_br: Somente a-z, A-Z, dígitos e sublinhados são nomes seguros em Ruby

source: Class Variable
pt_br: Variável de classe

source: Floating point number
pt_br: Número de ponto flutuante

source: Instance
pt_br: Instância

source: Global Variable
pt_br: Variável global

source: Todo Item
pt_br: Item afazer

source: Quoted String
pt_br: String citada

source: Documentation
pt_br: Documentação

source: Unused Element
pt_br: Elemento não utilizado

source: Abstract Element
pt_br: Elemento abstrato

source: Deprecated Element
pt_br: Elemento obsoleto

source: Static Member
pt_br: Membro estático

source: Private Member
pt_br: Membro privado

source: Package Private Member
pt_br: Membro privado do pacote

source: Protected Member
pt_br: Membro protegido

source: Public Member
pt_br: Membro público

source: Type Parameter
pt_br: Tipo do parâmetro

source: Type Parameter Use
pt_br: Uso do tipo de parâmetro

source: Undefined Element
pt_br: Elemento indefinido

source: Mark Occurrences
pt_br: Marcar ocorrências

source: import Java class
pt_br: importar classe Java

source: =begin/=end documentation
pt_br: documentação =begin/=end

source: Add # =&gt; Marker
pt_br: Adicionar # =&gt; Marcador

source: include Comparable …
pt_br: incluir Comparable …

source: Dir.glob("…") { |file| … }
pt_br: Dir.glob("…") { |arquivo| … }

source: include Enumerable …
pt_br: incluir Enumerable …

source: File.foreach ("…") { |line| … }
pt_br: File.foreach ("…") { |linha| … }

source: extend Forwardable
pt_br: estender Forwardable

source: Marshal.dump(…, file)
pt_br: Marshal.dump(…, arquivo)

source: YAML.dump(…, file)
pt_br: YAML.dump(…, arquivo)

source: YAML.load(file)
pt_br: YAML.load(arquivo)

source: each_line { |line| … }
pt_br: each_line { |linha| … }

source: each_pair { |name, val| … }
pt_br: each_pair { |nome, val| … }

source: each_slice(…) { |group| … }
pt_br: each_slice(…) { |grupo| … }

source: scan(/…/) { |match| … }
pt_br: scan(/…/) { |busca| … }

source: Create Several Columns
pt_br: Criar várias colunas

source: Add Column
pt_br: Adicionar coluna

source: Create Table
pt_br: Criar tabela

source: This method is generated dynamically by Rails, and will search your model for matches of the given column.
pt_br: Este método é gerado dinamicamente pelo Rails e pesquisará seu modelo para correspondências da coluna fornecida.

source: You can also search by combinations of columns by concatenating them with <code>_and_</code>.
pt_br: Você também pode procurar combinações de colunas concatenando-as com <code>_and_</code>.

source: No comment found
pt_br: Nenhum comentário encontrado

source: Ruby Library
pt_br: Biblioteca do Ruby

source: The file cannot be found.
pt_br: Arquivo não pôde ser encontrado.

source: Perhaps it has been deleted outside the IDE?
pt_br: Talvez tenha sido excluído fora do IDE?

source: You can force an update of the index by removing the var/cache/gsf-index directory in your user directory.
pt_br: Você pode forçar uma atualização no índice removendo o diretório var/cache/gsf-index em seu diretório de usuário.

source: Exception handling
pt_br: Manuseio de exceção

source: A begin...end block can offset a section of code.
pt_br: Um bloco begin...end pode deslocar uma seção de código.

source: It is typically used for exception handling.
pt_br: Isto é freqüentemente utilizado para manuseio de exceção.

source: puts "a bare begin/end alone isn't terribly useful' end
pt_br: puts "um simples begin/end não é muito útil' end

source: puts "however when used with a rescue, exception handling results"
pt_br: puts "entretanto quando utilizado com um rescue Exception pode manusear resultados"

source: raise Exception.new("my exception") rescue Exception => e
pt_br: raise Exception.new("minha exceção") rescue Exception => e

source: A begin...end block can stand alone, with one or more rescue blocks, and/or with an ensure block.
pt_br: Um bloco begin...end pode ficar sozinho, com um ou mais blocos rescue, e/ou com um bloco ensure.

source: puts "ensure blocks are useful for cleaning up resources regardless of errors that may occur"
pt_br: puts "blocos ensure são essenciais para limpar recursos negligentes de erros que possam ocorrer"

source: f = File.open("myfile")
pt_br: f = File.open("meu_arquivo")

source: # no NameError raised, so we'll not get here ensure
pt_br: # nenhum NameError foi lançado, então nós não pegamos o ensure aqui

source: # but we'll always get here, unless the interpreter or thread terminates
pt_br: # mas nós sempre iremos pegar aqui, a não ser que o interpretador ou a linha de execução termine

source: Note that Ruby's standard scoping for local variables holds for begin...end blocks as well: there is only one scope in a given method (not counting block-scoped variables).
pt_br: Observe que no padrão Ruby procura-se por variáveis locais que tenham blocos begin...end bem como: existe apenas um escopo num método dado (sem contar o escopo do bloco de variáveis)

source: The anonymous form of rescue only catches exceptions that descend from StandardError, as follows:
pt_br: A forma anônima do rescue captura somente exceções que descendem do StandardError, como a seguir:

source: eval "\"" # raises a SyntaxError rescue => e
pt_br: eval "\"" # lança um SyntaxError rescue => e

source: # The SyntaxError will not be caught end
pt_br: # O SyntaxError não será capturado end

source: Compare to:
pt_br: Compare com:

source: raise NameError.new("Some name error") rescue => e
pt_br: raise NameError.new("Algum nome de erro") rescue => e

source: # The NameError will be caught end
pt_br: # O NameError será capturado end

source: Ruby methods can optionally be supplied a block on invocation.
pt_br: Métodos Ruby podem opcionalmente serem fornecidos por uma invocação em um bloco

source: This block can optionally be made available as a Proc object using the & prefix on the final parameter of a method, but remains invocable at all times through the yield keyword.
pt_br: Este bloco pode opcionalmente disponibilizar um objeto Proc utilizando o prefixo & no parâmetro final de um método, mas resta invocá-lo em todas as vezes através da palavra-chave yield.

source: The yield keyword looks syntactically just like a method call on the current object.
pt_br: A palavra-chave yield parece sintaticamente com uma chamada de método no objeto atual.

source: It takes a list of parameters just like method calls and returns a value.
pt_br: Possui uma lista de parâmetros e valores de retorno assim como uma chamada de método

source: Even if the block argument is named in a method, code in that method can still invoke the block using yield, instead of calling the Proc object.
pt_br: Mesmo se o argumento em bloco é nomeado em um método, o código naquele método ainda pode ser invocado utilizando yield, instanciado de uma chamada do objeto Proc.

source: def both_ways(&block)
pt_br: def both_ways(&bloco)

source: However, these two forms are not identical.
pt_br: Entretanto, essas duas formas não são idênticas.

source: For example, redefinitions of Proc#call will affect the first invocation, but not the second.
pt_br: Por exemplo, redefinições do Proc#call irão afetar a primeira invocação, mas não a segunda.

source: Much like blocks can be named and captured as Proc objects inside a method, Procs can also be inserted into the block slot at method call time using the & prefix on the last argument of the call.
pt_br: Muitos como blocos podem ser nomeados e capturados como objetos Proc dentro de um método, Procs também podem serem inseridos dentro de um slot de bloco no tempo da chamada de método utilizando o prefixo & no útlimo argumento da chamada.

source: a_proc = proc{ puts "called" }
pt_br: a_proc = proc{ puts "chamada" }

source: A case statement matches the result of the case expression against each of the results of the when expression using the === matching operator.
pt_br: Uma instrução case coincide o resultado de uma expressão case para cada um dos resultados da expressão when utilizando o operador de coincidência ===.

source: There can be any number of when clauses, but only body of the first match is evaluated.
pt_br: Pode haver qualquer número de cláusulas when, mas somente o corpo da primeira correspondência é avaliado.

source: If no when clauses match, and the programmer has provided an else clause, that body is evaluated.
pt_br: Se não houver cláusula when correspondente, e o programador fornecer uma cláusula else, este corpo será avaliado.

source: If there is no match and no else clause, the case expression returns nil.
pt_br: Se não houver correspondência e também não tiver cláusula else, a expressão case retornará nil.

source: case degrees_in_kelvin
pt_br: case graus_em_kelvin

source: puts "solid"
pt_br: puts "sólido"

source: puts "liquid"
pt_br: puts "líquido"

source: puts "gas"
pt_br: puts "gás"

source: The case...when..else..end construct determines matching with the === method.
pt_br: O case...when..else..end constrói determinadas correspondências com o método ===.

source: The default === method inherited from Object is an equality test using equal?
pt_br: O método padrão === herdado de Object é igual a utilização do equal?

source: which performs strict object equality.
pt_br: o qual realiza uma igualdade de objeto precisa.

source: This method is implemented as an alias, however, so redefining the equals?
pt_br: Este método é implementado como um apelido, entretanto, redefine o equals?

source: method on a subclass will not change the behavior of the default inherited === method.
pt_br: o método numa subclasse não irá modificar o comportamento padrão da herança do método ===.

source: Many core classes like RegExp and Range provide === methods which match whole groups of objects.
pt_br: Várias classes de núcleo como RegExp e Range fornencem métodos === os quais correspondem completamente a grupos de objetos.

source: When the match is performed, the object from the when expression is the invocant and the object from the case expression is the argument.
pt_br: Quando a correspondência é verificada, o objeto da expressão when é o invocante e o objeto da expressão case é o argumento.

source: From the example above, the successful match is found with the following expression: /^he/ === "hello".
pt_br: A partir do exemplo a seguir, a correspondência correta é encontrada com a seguinte expressão: /^he/ === "hello".

source: Like most Ruby special forms, the case...when...else...end expression returns its result.
pt_br: Assim como na maioria das formas especiais do Ruby, a expressão case...when...else...end retorna este resultado.

source: This will be the result of the last expression evaluated inside the block
pt_br: Este será o resultado da última expressão analisada dentro do bloco

source: puts "this is not the value"
pt_br: puts "este não é o valor"

source: 0 # but this will be if x is in between 0 and 10
pt_br: 0 # porém este será se x estiver entre 0 e 10

source: Ruby features the standard if conditional in both expression and expression modifier form.
pt_br: Ruby apresenta o if condicional padrão tanto na expressão quanto na forma de modificador de expressão.

source: unless condition is exactly equivalent to if not condition in all contexts.
pt_br: unless condição é exatamente equivalente a if not condição em todos os contextos.

source: An if/unless expression returns the value of its last expression.
pt_br: Uma expressão if/unless retorna o valor da última expressão.

source: Block form
pt_br: Form em bloco

source: Syntax
pt_br: Sintaxe

source: if condition [then]
pt_br: if condição [then]

source: code
pt_br: código

source: [elsif condition [then]
pt_br: [elsif condição [then]

source: code]
pt_br: código]

source: unless condition
pt_br: unless condição

source: Explanation
pt_br: Explicação

source: The basic expression form of if looks like this, and must end with an end:
pt_br: A forma básica da expressão do if é algo como isto e deve terminar com um end:

source: if some_condition_expression
pt_br: if alguma_expressão_de_condição

source: # This section executed if some_condition_expression is true
pt_br: # Esta seção é executada caso alguma_expressão_de_condição seja verdadeira

source: The else-keyword can be used to provide a section that will be executed if the condition expression evaluates to false.
pt_br: A palavra-chave else pode ser utilizada para fornecer uma seção que será executada se a expressão da condição for avaliada como falsa.

source: Only one else may appear in an if-expression:
pt_br: Somente um else pode aparecer numa expressão if:

source: # This section executed if some_condition_expression is false
pt_br: # Esta seção é executada caso alguma_expressão_de_condição seja falsa

source: The elsif-keyword can be used to create multiple mutually exclusive conditionals.
pt_br: A palavra-chave elsif pode ser utilizada para criar múltiplas condições exclusivas reciprocamente.

source: If the conditional in the initial if is not true, then each elsif conditional is evaluated in descending order until one is true.
pt_br: Se a condição do if inicial não for verdadeira então cada condição elsif é avaliada em ordem descendente até que uma seja verdadeira.

source: If none is, the else-section is executed if there is one:
pt_br: Caso nenhuma seja verdadeira a seção else será executada caso exista:

source: if cond_one
pt_br: if cond_um

source: # cond_one is true
pt_br: # cond_um é verdadeiro

source: elsif cond_two
pt_br: elsif cond_dois

source: # cond_one is not true and cond_two is true
pt_br: # cond_um não é verdadeiro e cond_dois é verdadeiro

source: elsif cond_three
pt_br: elsif cond_tres

source: # cond_one is not true and cond_two is not true and cond_three is true
pt_br: # cond_um nem cond_dois são verdadeiras mas cond_tres é verdadeira

source: # cond_one, cond_two and cond_three are all not true
pt_br: # cond_um, cond_dois e cond_tres não são verdadeiras

source: With unless, it is not possible to define elsifs, just else.
pt_br: Com unless, não é possível definir os elsifs, apenas o else.

source: There if expression may have an optional then added, but it is usually elided.
pt_br: Esta expressão if deve ter adicionado um then opcionalmente, mas este é normalmente suprimido.

source: if some_condition_expression then
pt_br: if alguma_expressão_de_condição then

source: elsif some_other_condition_expression then
pt_br: elsif alguma_outra_expressão_de_condição then

source: However, then is necessary if you want to keep the if expression in a single line.
pt_br: Entretanto, o then é necessário se você deseja manter a expressão do if em uma única linha.

source: if some_condition_expression then do_something end
pt_br: if alguma_expressão_de_condição then faça_algo end

source: Formatting
pt_br: Formatando

source: Ruby Code Formatting Options
pt_br: Opções de formatação para código Ruby

source: Indents
pt_br: Indentação

source: &Category:
pt_br: &Categoria:

source: &Indentation Size:
pt_br: Tamanho da &indentação:

source: &Continuation Indentation Size:
pt_br: Tamanho da indentação de continuação:

source: Re&format Comments
pt_br: Re&formatar comentários

source: Indent &HTML within RHTML blocks
pt_br: Indentar &HTML dentro de blocos RHTML

source: # Here's a class that will be # reformatted # as you experiment with the options # on the left class Foo # Here's my method # documentation def bar(arg1, arg2="default") case arg1 when 1 puts "1!" when 2 puts "1+1!" end puts arg2, arg1 end end
pt_br: # Aqui está uma classe que pode ser # reformatada # como você experimentou com as opções # à esquerda class Foo # Aqui está minha documentação # do método def bar(arg1, arg2="default") case arg1 when 1 puts "1!" when 2 puts "1+1!" end puts arg2, arg1 end end

source: Creates a new Ruby on Rails application running on top of JRuby.
pt_br: Cria uma nova aplicação Ruby on Rails executando em cima do JRuby.

source: Ruby on Rails is a web framework.
pt_br: Ruby on Rails é um framework web.

source: More information is available at http://www.rubyonrails.org/.
pt_br: Mais informações estão disponíveis em http://www.rubyonrails.org/.

source: Ruby on Rails Project Support
pt_br: Suporte a projeto Ruby on Rails

source: Migrate Database
pt_br: Migrar banco de dados

source: To Current Version
pt_br: para versão atual

source: To Version {0} {1}
pt_br: para versão {0} {1}

source: Versions {0} through {1}
pt_br: Versões {0} ligadas a {1}

source: To Version 0 - Clear
pt_br: para versão 0 - Limpar

source: Migration
pt_br: Migração

source: Generate Rails Project
pt_br: Gerar projeto Rails

source: Tests
pt_br: Testes

source: Rake - Documentation
pt_br: Rake - Documentação

source: Rails Console
pt_br: Console Rails

source: Go to Rails Action or View
pt_br: Ir para Action ou View Rails

source: This action only applies to Controllers and Views in Ruby on Rails projects
pt_br: Esta ação aplica-se somente para Controllers e Views projetos Ruby on Rails

source: Controller file not found: Error in the project?
pt_br: O arquivo do Controller não foi encontrado: Erro no projeto?

source: This action only applies to Rails actions
pt_br: Esta ação aplica-se somente para actions Rails

source: This action only applies to Views
pt_br: Esta ação aplica-se somente para Views

source: View not found
pt_br: View não encontrada

source: Generate...
pt_br: Gerar...

source: Rails Generator
pt_br: Gerador Rails

source: Class "{0}" does not have a main method.
pt_br: A classe "{0}" não possui um método principal.

source: This directory is removed when the project is cleaned:
pt_br: Este diretório é removido quando executado Limpar projeto:

source: Space-separated list of JVM arguments used when running the project
pt_br: Lista separada por espaço de argumentos da JVM utilizados ao executar o projeto

source: (you may also define separate properties like run-sys-prop.name=value instead of -Dname=value
pt_br: (você também pode definir propriedades separadas como run-sys-prop.name=valor ao invés de -Dname=valor

source: or test-sys-prop.name=value to set system properties for unit tests):
pt_br: ou test-sys-prop.name=valor para definir propriedades do sistema para testes unitários):

source: Only compile against the classpath explicitly listed here:
pt_br: Compilar somente em conformidade com o classpath explicitamente listado aqui:

source: Space-separated list of extra javac options
pt_br: Lista separada por espaço de opções adicionais do javac

source: Source Files
pt_br: Arquivos de código-fonte

source: Test Files
pt_br: Arquivos de testes

source: <html><b>Project Needs Upgrading</b></html> This project was created in an earlier version of NetBeans IDE.
pt_br: <html><b>O projeto precisar ser atualizado</b></html> Este projeto foi criado em uma versão mais antiga do IDE NetBeans.

source: If you edit its properties in NetBeans IDE {0}, the project will be upgraded and <html><b>will no longer work in earlier versions of the IDE.</b></html>
pt_br: Se você editar isso nas propriedades do IDE NetBeans {0}, o projeto será atualizado e conseqüentemente <html><b>não irá funcionar novamente em versões mais antigas do IDE.</b></html>

source: Do you want to upgrade your project to version {0}?
pt_br: Você tem certeza que deseja atualizar seu projeto para a versão {0}?

source: Change Project Properties
pt_br: Alterar propriedades do projeto

source: Upgrade Project
pt_br: Atualizar projeto

source: The project is not of the current version.
pt_br: O projeto não é da versão atual.

source: <default>
pt_br: <padrao>

source: Controllers
pt_br: Controladores

source: Helpers
pt_br: Auxiliadores

source: Models
pt_br: Modelos

source: Views
pt_br: Visualizações

source: Database Migrations
pt_br: Migrações do banco de dados

source: Libs
pt_br: Bibliotecas

source: Configuration
pt_br: Configuração

source: Components
pt_br: Componentes

source: Public
pt_br: Público

source: Unit Tests
pt_br: Testes unitários

source: Functional Tests
pt_br: Testes funcionais

source: Test Fixtures
pt_br: Fixtures de teste

source: Test Mocks
pt_br: Mocks de teste

source: Integration Tests
pt_br: Testes de integração

source: Vendor
pt_br: Fornecedor

source: &API Method Names:
pt_br: Nomes dos métodos da &API:

source: &Arguments:
pt_br: &Argumentos:

source: When File Already Exists:
pt_br: Quando um arquivo já existe:

source: &Generate:
pt_br: &Gerar:

source: &Install Generators...
pt_br: &Instalar geradores...

source: &Overwrite
pt_br: S&obreescrever

source: &Preview Changes Only
pt_br: &Somente visualizar modificações

source: &Skip
pt_br: &Pular

source: &Model Name:
pt_br: Nome do &modelo:

source: &Name:
pt_br: &Nome:

source: &Controller Name:
pt_br: Nome do &controller:

source: &Actions:
pt_br: &Ações:

source: &Views:
pt_br: &Visualizações:

source: Rails Projects
pt_br: Projeto Rails

source: Show &Logical Project View (Restart Required)
pt_br: Exibir visualização de projeto lógico (é necessário reiniciar)

source: Ruby on Rails Projects
pt_br: Projetos Ruby on Rails

source: WEBrick for {0} on {1}
pt_br: WEBrick para {0} em {1}

source: WEBrick Web Server
pt_br: Servidor web WEBrick

source: Mongrel for {0} on {1}
pt_br: Mongrel para {0} em {1}

source: Mongrel Web Server
pt_br: Servidor web Mongrel

source: LightTPD for {0} on {1}
pt_br: LightTPD para {0} em {1}

source: LightTPD Web Server
pt_br: Servidor web LightTPD

source: Server Startup
pt_br: Inicialização do servidor

source: Could not connect to the web server - cannot show {0}
pt_br: Não foi possível conectar ao servidor - não pode exibir {0}

source: The web server failed to start because the port number {0} is already in use, and nearby ports could not be used.
pt_br: O servidor web falhou ao iniciar porque a porta {0} já está em uso e portas vizinhas não podem ser utilizadas.

source: Edit the project properties and choose an available port, or shut down the other service using the port.
pt_br: Edite as propriedades do projeto e escolha uma porta disponível ou finalize o outro serviço o qual está utilizando esta porta.

source: Close Window
pt_br: Fechar janela

source: Add Repository URL
pt_br: Adicionar repositório URL

source: Rails Plugins...
pt_br: Plugins Rails...

source: Rails Plugins
pt_br: Plugins Rails

source: Your project is missing a vendor/plugins directory
pt_br: Seu projeto está faltando um fornecedor/plugins

source: Plugin Installation Settings
pt_br: Configurações de instalações de Plugin

source: Please wait...
pt_br: Por favor aguarde...

source: Finding installed plugins
pt_br: Encontrando plugins instalados

source: Please Wait...
pt_br: Por favor aguarde...

source: Finding configured repositories
pt_br: Encontrando repositórios configurados

source: Fetching list of plugins from server
pt_br: Obtendo lista de plugins a partir do servidor

source: Discovering available repositories
pt_br: Descobrindo repositórios disponíveis

source: Rails Plugin Installation
pt_br: Instalação do plugin do Rails

source: Installation Failed
pt_br: A instalação falhou

source: Installation Succeeded
pt_br: A instalação terminou com sucesso

source: Use &Subversion
pt_br: Utilizar &Subversion

source: Use svn &checkout to grab the plugin
pt_br: Utilizar &checkout svn para pegar o plugin

source: Use svn:&externals to grab the plugin
pt_br: Utilizar svn:&externals para pegar o plugin

source: Specific &revision:
pt_br: &Revisão específica:

source: Modify Repository List
pt_br: Modificar lista de repositório

source: Modifying Repositories Failed
pt_br: Houve falha ao modificar os repositórios
